#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.list_collections.module.lambda_function_container_image.data.external.archive_prepare[0]: Reading...
aws_security_group.lambda_memory_sg: Refreshing state... [id=sg-095dd1eeeaae3278f]
aws_security_group.lambda_ingestion_sg: Refreshing state... [id=sg-05f52007bac6950c2]
aws_security_group.lambda_inference_sg: Refreshing state... [id=sg-0b0ddc171bf5034b3]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 1s [id=446872271111]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
data.aws_availability_zones.available: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_ami.latest_amazon_linux: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
data.aws_ami.latest_amazon_linux: Read complete after 0s [id=ami-046eeba8a7f7bbefd]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
data.aws_secretsmanager_secret_version.password: Reading...
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
data.aws_secretsmanager_secret_version.password: Read complete after 1s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-05fee5c54d8dd836b]
aws_security_group.sm_sg: Refreshing state... [id=sg-0420257bd72285220]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-064b222fa41adf8a4]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-02f500d8488580664]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-071e9585e30063b9a]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
aws_instance.jumpbox: Refreshing state... [id=i-00e8aa293b50882b6]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0baeb867effb860d7]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-0b92742de93a2719b]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a68a0d1d041b083e]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2554341540]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ last_modified                  = "2024-01-27T00:41:52.000+0000" -> "2024-01-27T02:10:00.000+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # aws_security_group.bedrock_sg will be updated in-place
  ~ resource "aws_security_group" "bedrock_sg" {
        id                     = "sg-05fee5c54d8dd836b"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Bedrock runtime sg"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-05f52007bac6950c2",
                  - "sg-0b0ddc171bf5034b3",
                ]
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Bedrock runtime sg"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "bedrock-runtime-sg-dev"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.database_sg will be updated in-place
  ~ resource "aws_security_group" "database_sg" {
        id                     = "sg-02511ace313a817bd"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "VectorDB ingress"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05f52007bac6950c2",
                  - "sg-0b0ddc171bf5034b3",
                  - "sg-0b9900b5db426c576",
                ]
              - self             = false
              - to_port          = 5432
            },
          + {
              + cidr_blocks      = []
              + description      = "VectorDB ingress"
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
            },
        ]
        name                   = "database-sg-main-dev"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.dynamo_db_sg will be updated in-place
  ~ resource "aws_security_group" "dynamo_db_sg" {
        id                     = "sg-064b222fa41adf8a4"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Dynamo DB ingress"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-095dd1eeeaae3278f",
                ]
              - self             = false
              - to_port          = 443
            },
          + {
              + cidr_blocks      = []
              + description      = "Dynamo DB ingress"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 443
            },
        ]
        name                   = "dynamo-sg-dev"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_security_group.lambda_egress_all_sg will be created
  + resource "aws_security_group" "lambda_egress_all_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Lambda egress all"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "public-lambda-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-00fb300ee2d2f7b3b"
    }

  # aws_security_group.lambda_inference_sg will be destroyed
  # (because aws_security_group.lambda_inference_sg is not in configuration)
  - resource "aws_security_group" "lambda_inference_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:446872271111:security-group/sg-0b0ddc171bf5034b3" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Lambda Inference"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0b0ddc171bf5034b3" -> null
      - ingress                = [] -> null
      - name                   = "lambda-inference-sg-dev" -> null
      - owner_id               = "446872271111" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Environment" = "dev-dev"
          - "Project"     = "levio-aws-demo-fev-dev"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-00fb300ee2d2f7b3b" -> null
    }

  # aws_security_group.lambda_ingestion_sg will be destroyed
  # (because aws_security_group.lambda_ingestion_sg is not in configuration)
  - resource "aws_security_group" "lambda_ingestion_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:446872271111:security-group/sg-05f52007bac6950c2" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Lambda Ingestion"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-05f52007bac6950c2" -> null
      - ingress                = [] -> null
      - name                   = "lambda-ingestion-sg-dev" -> null
      - owner_id               = "446872271111" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Environment" = "dev-dev"
          - "Project"     = "levio-aws-demo-fev-dev"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-00fb300ee2d2f7b3b" -> null
    }

  # aws_security_group.lambda_memory_sg will be destroyed
  # (because aws_security_group.lambda_memory_sg is not in configuration)
  - resource "aws_security_group" "lambda_memory_sg" {
      - arn                    = "arn:aws:ec2:us-east-1:446872271111:security-group/sg-095dd1eeeaae3278f" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Lambda Memory"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-095dd1eeeaae3278f" -> null
      - ingress                = [] -> null
      - name                   = "lambda-memory-sg-dev" -> null
      - owner_id               = "446872271111" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {
          - "Environment" = "dev-dev"
          - "Project"     = "levio-aws-demo-fev-dev"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-00fb300ee2d2f7b3b" -> null
    }

  # aws_security_group.sm_sg will be updated in-place
  ~ resource "aws_security_group" "sm_sg" {
        id                     = "sg-0420257bd72285220"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Secrets Manager"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = [
                  - "sg-05f52007bac6950c2",
                  - "sg-0b0ddc171bf5034b3",
                ]
              - self             = false
              - to_port          = 0
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Secrets Manager"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
        name                   = "secret-manager-sg-dev"
        tags                   = {}
        # (7 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.lambda_endpoint will be updated in-place
  ~ resource "aws_vpc_endpoint" "lambda_endpoint" {
        id                    = "vpce-0baeb867effb860d7"
      ~ security_group_ids    = [
          - "sg-095dd1eeeaae3278f",
        ] -> (known after apply)
        tags                  = {}
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "EMBEDDING_COLLECTION_NAME"     = "levio-demo-fev-storage-dev-ski-regulations" -> "levio-demo-fev-storage-dev"
              ~ "ENABLE_HISTORY"                = "0" -> "1"
              ~ "TOP_P"                         = "0.9" -> "0.99"
                # (17 unchanged elements hidden)
            }
        }

      ~ vpc_config {
          ~ security_group_ids          = [
              - "sg-0b0ddc171bf5034b3",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ memory_size                    = 1024 -> 256
        tags                           = {}
      ~ timeout                        = 500 -> 120
        # (18 unchanged attributes hidden)

      ~ vpc_config {
          ~ security_group_ids          = [
              - "sg-05f52007bac6950c2",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/levio-demo-fev-list-collections-dev"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-list-collections-dev-role-inline"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:CreateNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "accessnetworkinterface"
                    },
                  + {
                      + Action   = "logs:CreateLogGroup"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                      + Sid      = "loggroup"
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:log-group:/aws/levio-demo-fev-list-collections-dev/*:*"
                      + Sid      = "logwrite"
                    },
                  + {
                      + Action   = [
                          + "rds-db:execute-statement",
                          + "rds-db:connect",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:rds:us-east-1:446872271111:db:vector_db_dev"
                      + Sid      = "rdsconnectread"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "levio-demo-fev-list-collections-dev-role-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "levio-demo-fev-list-collections-dev-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-list-collections-dev-role"
    }

  # module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "levio-demo-fev-list-collections-dev-role"
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
        tags                           = {}
        # (20 unchanged attributes hidden)

      ~ vpc_config {
          ~ security_group_ids          = [
              - "sg-095dd1eeeaae3278f",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 7 to add, 8 to change, 3 to destroy.

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Infrastructure planning and management`*